.class public final Lۥۜ۫ۜ۫ۛۧۡۖ۟ۥۨۗۜۜ۟۫ۧۗ۫ۧۘۘۘۡ۠ۘۛۥۘۙۧۤۨۥ۬ۚۗ۟ۖۦۚۤۨۢۛۖۗۥ۫ۨۘۨۗۖۗۚ۫ۗۜۧ۟ۤۛۜ۟ۜۘ۬ۧۛۜۗ۬ۙۗ۬۟ۗۜۡۡۡۙ۬ۡۛۙۡ$d;
.super Ljava/lang/Object;


# instance fields
.field private final handle:Lۥۜ۫ۜ۫ۛۧۡۖ۟ۥۨۗۜۜ۟۫ۧۗ۫ۧۘۘۘۡ۠ۘۛۥۘۙۧۤۨۥ۬ۚۗ۟ۖۦۚۤۨۢۛۖۗۥ۫ۨۘۨۗۖۗۚ۫ۗۜۧ۟ۤۛۜ۟ۜۘ۬ۧۛۜۗ۬ۙۗ۬۟ۗۜۡۡۡۙ۬ۡۛۙۡ$f;

.field private final member:Ljava/lang/reflect/Member;


# direct methods
.method public constructor <init>()V
    .locals 1

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    const/4 v0, 0x0

    iput-object v0, p0, Lۥۜ۫ۜ۫ۛۧۡۖ۟ۥۨۗۜۜ۟۫ۧۗ۫ۧۘۘۘۡ۠ۘۛۥۘۙۧۤۨۥ۬ۚۗ۟ۖۦۚۤۨۢۛۖۗۥ۫ۨۘۨۗۖۗۚ۫ۗۜۧ۟ۤۛۜ۟ۜۘ۬ۧۛۜۗ۬ۙۗ۬۟ۗۜۡۡۡۙ۬ۡۛۙۡ$d;->member:Ljava/lang/reflect/Member;

    iput-object v0, p0, Lۥۜ۫ۜ۫ۛۧۡۖ۟ۥۨۗۜۜ۟۫ۧۗ۫ۧۘۘۘۡ۠ۘۛۥۘۙۧۤۨۥ۬ۚۗ۟ۖۦۚۤۨۢۛۖۗۥ۫ۨۘۨۗۖۗۚ۫ۗۜۧ۟ۤۛۜ۟ۜۘ۬ۧۛۜۗ۬ۙۗ۬۟ۗۜۡۡۡۙ۬ۡۛۙۡ$d;->handle:Lۥۜ۫ۜ۫ۛۧۡۖ۟ۥۨۗۜۜ۟۫ۧۗ۫ۧۘۘۘۡ۠ۘۛۥۘۙۧۤۨۥ۬ۚۗ۟ۖۦۚۤۨۢۛۖۗۥ۫ۨۘۨۗۖۗۚ۫ۗۜۧ۟ۤۛۜ۟ۜۘ۬ۧۛۜۗ۬ۙۗ۬۟ۗۜۡۡۡۙ۬ۡۛۙۡ$f;

    return-void
.end method
